Tekla Open API Reference for Tekla Structures 2025
RebarSet.LegFaces Property
 Gets or sets the rebar set's leg faces.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public List<RebarLegFace> LegFaces { get; set; }
Public Property LegFaces As List(Of RebarLegFace)
	Get
	Set
Property Value
Type: List<RebarLegFace>
See Also
Reference
RebarSet Class
Tekla.Structures.Model Namespace